import React from 'react'
import { useParams } from 'react-router-dom'
import s from "./images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1.png"
import s2 from "./images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (1).png"
import s3 from "./images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (2).png"
import s4 from "./images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (3).png"
import s5 from "./images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (4).png"
import s6 from "./images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (5).png"
import s7 from "./images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (6).png"
import s8 from "./images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (7).png"
import f from "./images/Group 89.png"
import f2 from "./images/Group 114.png"
import f3 from "./images/Group 114 (1).png"
import f4 from "./images/Group 114 (2).png"
import line from "./images/Group 73.png"
import grocery from "./images/Group 85.png"

const Info = () => {
  let { id } = useParams()

  let data = [
    {
            img: s,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "1"
          },
    
          {
            img: s2,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "2"
          },
    
          {
            img: s3,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "3"
          },
    
          {
            img: s4,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "4"
          },
    
          {
            img: s5,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "5"
          },
    
          {
            img: s6,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "6"
          },
    
          {
            img: s7,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "7"
          },
    
          {
            img: s8,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "8"
          },
    
          {
            img: s4,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "9"
          },
    
          {
            img: s3,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "10"
          },
    
          {
            img: s2,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "11"
          },
    
          {
            img: s,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "12"
          },
    
          {
            img: s8,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "13"
          },
    
          {
            img: s7,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "14"
          },
    
          {
            img: s6,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "15"
          },
    
          {
            img: s5,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "16"
          },
    
          {
            img: s8,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "17"
          },
    
          {
            img: s7,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "18"
          },
    
          {
            img: s6,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "19"
          },
    
          {
            img: s5,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "20"
          },
    
          {
            img: s4,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "21"
          },
    
          {
            img: s3,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "22"
          },
    
          {
            img: s2,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "23"
          },
    
          {
            img: s,
            price: "2 491 ₽/шт.",
            name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
            id: "24"
          },
  ]

  let product = data.find(el => el.id == id)
  console.log(data);
  

  return (
    <div className="mt-[50px]">

      <h1 className='text-[40px] text-center lg:text-start'>{product.name}</h1>

      <div className='mt-[100px] flex justify-around items-start flex-wrap gap-[25px]'>
        <img src={product.img} alt="" className='lg:w-[600px]'/>

        <div>
          <p>Цена за штуку</p>
          <p className='text-[40px] text-[#287FE8] my-[15px]'><b>{product.price}</b></p>
          <img src={f} alt=""/>
        </div>

        <div>
          <p>Толщина в мм</p>
          <img src={f2} alt="" />
          <br/><br/>
          <p>Кол-во шт. в упаковке</p>
          <img src={f3} alt="" />
          <br/><br/>
          <p>Цвет</p>
          <img src={f4} alt="" />
        </div>
      </div>

      <h3 className='text-[35px] text-center lg:p-[50px] lg:text-start'>Описание</h3>
      <p className='px-[50px] text-[18px]'>Минеральный утеплитель ТеплоKNAUF Стена Extra разработан специально для теплоизоляции наружных каркасных стен. Изготовлен из натуральных природных компонентов, в его составе не содержится фенол-формальдегидных и акриловых смол, это безопасный материал. Он не колется и не вызывает зуда при монтаже, мало пылит и мягкий на ощупь, без неприятных запахов. В том числе поэтому утеплитель ТеплоKNAUF Стена Extra рекомендуется применять для детских комнат или спален.
      <br/><br/>  
      <b className='text-[25px]'>Особенности:</b>
      <br/>
      Простота и удобство в работе: материал легко режется, отлично монтируется враспор между стойками каркаса.
      Материал благодаря своей упругости и прочности держится в конструкции, не спадая и не оседая
      <br/><br/>
      Формат – плита, толщина материала – 50 мм. Размер плиты удобен для монтажа силами одного человекаДолговечность: срок службы не менее 50 лет.<br/><br/>
      Компактно упакован: материал сжат в упаковке для более экономичной транспортировки и хранения. Подобная пачка содержит на 11% больше изоляции, чем обычная упаковка несжатой изоляции.Защищен от влаги за счет гидрофобизирующей технологии AquastatikНе горит и не выделяет резкого удушливого дыма Произведен в России.
      <br/><br/>
      <b className='text-[25px]'>Способ установки при утеплении наружных каркасных стен:</b>
      <br/><br/>
      Для фиксации утеплителя рекомендуется монтировать каркас с шагом между стойками – 590 мм в свету.
      Утеплитель устанавливается в каркас с поджатием по ширине 10-15 мм. Если каркас металлический, профиль также нужно заполнять утеплителем. Каждый последующий слой утеплителя монтируется с перекрытием стыков. Теплоизоляция должна плотно прилегать к элементам конструкции и монтироваться враспор. Не должно быть щелей и зазоров.
      <br/><br/>
      Установка снаружи здания ветро-гидрозащитной мембраны. Она раскатывается по каркасу и фиксируется с помощью шурупов по стойкам металлического каркаса или строительным степлером – к деревянному. Мембрана устанавливается снизу вверх, каждый последующий слой – выше предыдущего, внахлест - 10-15 см. Стыки рекомендуется проклеивать строительной лентой.Установка прижимного бруса для создания вентиляционного зазора.
      Монтаж внешней отделки фасада согласно рекомендациям производителя.Установка внутри здания пароизоляционной пленки. Она раскатывается по каркасу и фиксируется с помощью шурупов по стойкам металлического каркаса или строительным степлером – к деревянному. Пленка устанавливается снизу вверх, каждый последующий слой – выше предыдущего, внахлест - 10-15 см. Стыки, места крепления и поврежденные области обязательно проклеивать строительной лентой.</p>

      <h2 className='text-[35px] mt-[50px]'>Характеристики</h2>
      <div className='mt-[50px] text-[18px] flex justify-around items-center flex-wrap gap-[25px]'>
        <div>
          <p>Площадь покрытия продуктом (м²) ______________ 6</p>
          <br/>
          <p>Толщина (мм) ___________________________________ 50</p>
          <br/>
          <p>Плотность (кг/м³) _______________________________ 22</p>
          <br/>
          <p>Группа горючести _______________________________ Негорючий</p>
          <br/>
          <p>Коэффициент теплопроводности (Вт/м°С) ______ 0.034</p>
          <br/>
          <p>Место использования __________________________ Внутренний</p>
          <br/>
          <p>Назначение _____________________________________ Каркасная стена, Стяжка пола</p>
        </div>

        <div>
          <p>Площадь покрытия продуктом (м²) ______________ 6</p>
          <br/>
          <p>Толщина (мм) ___________________________________ 50</p>
          <br/>
          <p>Плотность (кг/м³) _______________________________ 22</p>
          <br/>
          <p>Группа горючести _______________________________ Негорючий</p>
          <br/>
          <p>Коэффициент теплопроводности (Вт/м°С) ______ 0.034</p>
          <br/>
          <p>Место использования __________________________ Внутренний</p>
          <br/>
          <p>Назначение _____________________________________ Каркасная стена, Стяжка пола</p>
        </div>
      </div>

      <br/><br/>
      <h2 className='text-center text-[35px]'>С этим товаром покупают</h2>

      <div className='mt-[100px] flex justify-around items-center flex-wrap gap-[25px]'>
      {data.map((el) => {
        return (
          <div className='text-center w-[300px]'>
            <img src={el.img} alt="" className='m-auto'/>
            <img src={line} alt="" className='m-auto my-[15px]'/>
            <p>{el.name}</p>
            <p className='text-[30px] text-[#1D6BDD] my-[15px]'><b>{el.price}</b></p>
            <div className='flex justify-between items-center'>
              <button className='border w-[50px] h-[50px]'>-</button>
              <button className='border w-[50px] h-[50px]'>1</button>
              <button className='border w-[50px] h-[50px]'>+</button>
              <img src={grocery} alt="" />
            </div>
          </div>
        )
      })}
    </div>
    </div>
  )
}

export default Info
