import React from 'react'

const About = () => {
	return (
		<section className='px-[10px] md:px-[10%] py-[10px] md:py-[30px] '>
			<div className='flex items-center gap-[10px]'>
				<p className='text-[16px] font-[400] leading-[100%] text-[#707070]'>
					Главная
				</p>
				<p className='text-[20px] font-[400] leading-[100%] text-[#287FE8]'>
					•
				</p>
				<p className='text-[16px] font-[400] leading-[100%] text-[#707070]'>
					Политика конфиденциальности
				</p>
			</div>
			<br />
			<br />
			<h2 className='text-[#1E2126] font-[400] text-[30px] md:text-[50px] leading-[40px] md:leading-[60px]'>
				Политика конфиденциальности
			</h2>
			<br />
			<span className='text-[#707070] font-[500] text-[14px] md:text-[16px] leading-[20px]'>
        <span className='text-[#1E2126] font-[700] text-[18px] md:text-[20px] leading-[20px]'>1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</span>
				<br />
				<br />
				1.1. В настоящей Политике конфиденциальности используются следующие
				термины: 1.1.1. «Персональные данные» - любая информация, относящаяся к
				прямо или косвенно определенному, или определяемому физическому лицу
				(субъекту персональных данных). 1.1.2. «Обработка персональных данных» -
				любое действие (операция) или совокупность действий (операций),
				совершаемых с использованием средств автоматизации или без использования
				таких средств с персональными данными, включая сбор, запись,
				систематизацию, накопление, хранение, уточнение (обновление, изменение),
				извлечение, использование, передачу (распространение, предоставление,
				доступ), обезличивание, блокирование, удаление, уничтожение персональных
				данных. 1.1.3. «Конфиденциальность персональных данных» - обязательное
				для соблюдения Оператором или иным получившим доступ к персональным
				данным лицом требование не допускать их распространения без согласия
				субъекта персональных данных или наличия иного законного основания.
				1.1.4. «Пользователь сайта Общества (далее – Пользователь)» – лицо,
				имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт
				Общества.
				<br />
				<br />
        <span className='text-[#1E2126] font-[700] text-[18px] md:text-[20px] leading-[20px]'>2. ОБЩИЕ ПОЛОЖЕНИЯ</span>
				<br />
				<br />
				2.1. Обработка и обеспечение безопасности персональных данных
				осуществляется Обществом в соответствии с требованиями: - Федерального
				закона № 152-ФЗ от 27.07.2006г. «О персональных данных», - иных
				нормативных актов, определяющих случаи и особенности обработки
				персональных данных; - настоящей Политики конфиденциальности. 2.2.
				Общество вправе поручить обработку персональных данных другому лицу с
				согласия субъекта персональных данных, если иное не предусмотрено
				федеральным законом, на основании заключаемого с этим лицом договора.
				2.3. В случаях, установленных законодательством Российской Федерации,
				Общество вправе осуществлять передачу персональных данных. 2.4.
				Использование Пользователем сайта Общества означает согласие с настоящей
				Политикой конфиденциальности и условиями обработки персональных данных
				Пользователя. 2.5. В случае несогласия с условиями Политики
				конфиденциальности Пользователь должен прекратить использование сайта
				Общества. 2.6. Настоящая Политика конфиденциальности применяется только
				к сайту Общества. Общество не контролирует и не несет ответственность за
				сайты третьих лиц, на которые Пользователь может перейти по ссылкам,
				доступным на сайте Общества. 2.7. Общество не проверяет достоверность
				персональных данных, предоставляемых Пользователем сайта Общества.
				<br />
				<br />
        <span className='text-[#1E2126] font-[700] text-[18px] md:text-[20px] leading-[20px]'>3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</span>
				<br />
				<br />
				3.1. Настоящая Политика конфиденциальности устанавливает обязательства
				Общества по неразглашению и обеспечению режима защиты конфиденциальности
				персональных данных, которые Пользователь предоставляет по запросу
				Общества при заполнении формы обратной связи на сайте Общества, при
				оформлении заказа, при входе в личный кабинет в соответствующих разделах
				сайта. 3.2. Персональные данные, разрешённые к обработке в рамках
				настоящей Политики конфиденциальности, предоставляются Пользователем
				путём заполнения соответствующей формы на сайте Общества и включают в
				себя следующую информацию: 3.2.1. фамилию, имя, отчество Пользователя;
				3.2.2. контактный телефон Пользователя; 3.2.3. e-mail Пользователя;
				3.2.4. адрес.
				<br />
				<br />
        <span className='text-[#1E2126] font-[700] text-[18px] md:text-[20px] leading-[20px]'>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</span>
				<br />
				<br />
				4.1. Персональные данные Пользователя Общество может использовать в
				целях: 4.1.1. Установления с Пользователем обратной связи, включая
				направление уведомлений, запросов, касающихся использования Сайта
				Общества, обработки запросов и заявок от Пользователя. 4.1.2.
				Предоставления Пользователю с его согласия, обновлений товаров и услуг,
				специальных предложений, информации о ценах, новостной рассылки и иных
				сведений от имени Общества. 4.1.3. Для предоставления информации и
				услуг, которые запрашивает Пользователь. 4.1.4. Для улучшения качества
				продуктов сайта и предоставляемых услуг. 4.1.5. Определения места
				нахождения Пользователя для обеспечения безопасности, предотвращения
				мошенничества. 4.1.6. Подтверждения достоверности и полноты персональных
				данных, предоставленных Пользователем.
				<br />
				<br />
        <span className='text-[#1E2126] font-[700] text-[18px] md:text-[20px] leading-[20px]'>5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</span>
				<br />
				<br />
				5.1. Обработка персональных данных Пользователя осуществляется без
				ограничения срока, любым законным способом, в том числе в информационных
				системах персональных данных с использованием средств автоматизации или
				без использования таких средств. 5.2. Пользователь соглашается с тем,
				что Общество вправе передавать персональные данные третьим лицам, в
				соответствии с нормами законодательства Российской Федерации. 5.3.
				Персональные данные Пользователя могут быть переданы уполномоченным
				органам государственной власти Российской Федерации только по основаниям
				и в порядке, установленным законодательством Российской Федерации. 5.4.
				При утрате или разглашении персональных данных Общество информирует
				Пользователя об утрате или разглашении персональных данных. 5.5.
				Общество принимает необходимые организационные и технические меры для
				защиты персональной информации Пользователя от неправомерного или
				случайного доступа, уничтожения, изменения, блокирования, копирования,
				распространения, а также от иных неправомерных действий третьих лиц.
				5.6. Общество совместно с Пользователем принимает все необходимые меры
				по предотвращению убытков или иных отрицательных последствий, вызванных
				утратой или разглашением персональных данных Пользователя.
				<br />
				<br />
        <span className='text-[#1E2126] font-[700] text-[18px] md:text-[20px] leading-[20px]'>6. ОБЯЗАТЕЛЬСТВА СТОРОН</span>
				<br />
				<br />
				6.1. Пользователь обязан: 6.1.1. Предоставить информацию о персональных
				данных, необходимую для пользования Сайтом Общества. 6.1.2. Обновить,
				дополнить предоставленную информацию о персональных данных в случае
				изменения данной информации. 6.2. Общество обязано: 6.2.1. Использовать
				полученную информацию исключительно для целей, указанных в разделе 4
				настоящей Политики конфиденциальности. 6.2.2. Обеспечить хранение
				конфиденциальной информации в тайне, не разглашать без предварительного
				письменного разрешения Пользователя, а также не осуществлять продажу,
				обмен, опубликование, либо разглашение иными возможными способами
				переданных персональных данных Пользователя, за исключением п.п. 5.2. и
				5.3. настоящей Политики Конфиденциальности. 6.2.3. Принимать меры
				предосторожности для защиты конфиденциальности персональных данных
				Пользователя согласно порядку, обычно используемого для защиты такого
				рода информации в существующем деловом обороте. 6.2.4. Осуществить
				блокирование персональных данных, относящихся к соответствующему
				Пользователю, с момента обращения или запроса Пользователя, или его
				законного представителя либо уполномоченного органа по защите прав
				субъектов персональных данных на период проверки, в случае выявления
				недостоверных персональных данных или неправомерных действий.
				<br />
				<br />
        <span className='text-[#1E2126] font-[700] text-[18px] md:text-[20px] leading-[20px]'>7. ОТВЕТСТВЕННОСТЬ СТОРОН</span>
				<br />
				<br />
				7.1. Общество, не исполнившее свои обязательства, несёт ответственность
				за убытки, понесённые Пользователем в связи с неправомерным
				использованием персональных данных, в соответствии с законодательством
				Российской Федерации, за исключением случаев, предусмотренных п.п. 5.2.,
				5.3. и 7.2. настоящей Политики Конфиденциальности. 7.2. В случае утраты
				или разглашения Конфиденциальной информации Общество не несёт
				ответственность, если данная информация: 7.2.1. Стала публичным
				достоянием до её утраты или разглашения. 7.2.2. Была получена от третьей
				стороны до момента её получения Обществом. 7.2.3. Была разглашена с
				согласия Пользователя.
				<br />
				<br />
        <span className='text-[#1E2126] font-[700] text-[18px] md:text-[20px] leading-[20px]'>8. РАЗРЕШЕНИЕ СПОРОВ</span>
				<br />
				<br />
				8.1. До обращения в суд с иском по спорам, возникающим из отношений
				между Пользователем сайта и Обществом, обязательным является
				предъявление претензии (письменного предложения о добровольном
				урегулировании спора). 8.2. Получатель претензии в течение 30
				календарных дней со дня получения претензии, письменно уведомляет
				заявителя претензии о результатах рассмотрения претензии. 8.3. При не
				достижении соглашения спор подлежит передаче на рассмотрение в судебные
				инстанции в соответствии с действующим законодательством Российской
				Федерации. 8.4. К настоящей Политике конфиденциальности и отношениям
				между Пользователем и Обществом применяется действующее законодательство
				Российской Федерации.
				<br />
				<br />
        <span className='text-[#1E2126] font-[700] text-[18px] md:text-[20px] leading-[20px]'>9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</span>
				<br />
				<br />
				9.1. Общество вправе вносить изменения в настоящую Политику
				конфиденциальности без согласия Пользователя. 9.2. Новая Политика
				конфиденциальности вступает в силу с момента ее размещения на Сайте
				Общества, если иное не предусмотрено новой редакцией Политики
				конфиденциальности. 9.3. Действующая Политика конфиденциальности
				размещена на сайте Общества.
			</span>
		</section>
	)
}

export default About
