import { createSlice } from '@reduxjs/toolkit'
import s from "../images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1.png"
import s2 from "../images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (1).png"
import s3 from "../images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (2).png"
import s4 from "../images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (3).png"
import s5 from "../images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (4).png"
import s6 from "../images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (5).png"
import s7 from "../images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (6).png"
import s8 from "../images/0b3d8cb55d0a04b48fdb63f6e48021bf-1000x1000 1 (7).png"

export let todoSlice = createSlice({
  name: "todolist",
  initialState: {
    data:[
      {
        img: s,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "1"
      },

      {
        img: s2,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "2"
      },

      {
        img: s3,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "3"
      },

      {
        img: s4,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "4"
      },

      {
        img: s5,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "5"
      },

      {
        img: s6,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "6"
      },

      {
        img: s7,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "7"
      },

      {
        img: s8,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "8"
      },

      {
        img: s4,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "9"
      },

      {
        img: s3,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "10"
      },

      {
        img: s2,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "11"
      },

      {
        img: s,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "12"
      },

      {
        img: s8,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "13"
      },

      {
        img: s7,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "14"
      },

      {
        img: s6,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "15"
      },

      {
        img: s5,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "16"
      },

      {
        img: s8,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "17"
      },

      {
        img: s7,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "18"
      },

      {
        img: s6,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "19"
      },

      {
        img: s5,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "20"
      },

      {
        img: s4,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "21"
      },

      {
        img: s3,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "22"
      },

      {
        img: s2,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "23"
      },

      {
        img: s,
        price: "2 491 ₽/шт.",
        name: "Пеноплекс Кофморт 1185х585х20мм 20 плит, 13.86м2, 0.278м3",
        id: "24"
      },
    ]
  },
  reducers: {
    deleteUser:(state, action) => {
      state.data = state.data.filter((e) => e.id != action.payload)
    },
    addUser:(state, action) => {
      state.data = [...state.data, action.payload]
    },
    editUser: (state, action) => {
      state.data = state.data.map((el) =>
        el.id === action.payload.id ? { ...el, ...action.payload } : el
      )
    }

  }
})

export let { deleteUser, addUser, editUser } = todoSlice.actions